# RbsElecNumberOfCircuits Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..RbsElecNumberOfCircuits Property
ParameterTypeId Class See Also
---
"Max Number of Circuits"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId RbsElecNumberOfCircuits { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property RbsElecNumberOfCircuits As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ RbsElecNumberOfCircuits {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace